In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [ ]:
# Download Green Taxi Data (Nov 2025)
!wget https://d37ci6vzurychx.cloudfront.net/trip-data/green_tripdata_2025-11.parquet

In [ ]:
# Download Zones Lookup
!wget https://github.com/DataTalksClub/nyc-tlc-data/releases/download/misc/taxi_zone_lookup.csv

In [3]:
# 1. Connect to Database
# (User=root, Pass=root, Host=localhost, Port=5432, DB=ny_taxi)
engine = create_engine('postgresql+psycopg2://root:root@localhost:5432/ny_taxi')

# 2. Ingest Green Taxi Data (Parquet)
print("Reading Parquet file...")
df_green = pd.read_parquet('green_tripdata_2025-11.parquet')

print(f"Uploading {len(df_green)} rows to Postgres...")
# chunksize breaks it into small bites so your memory doesn't explode
df_green.to_sql(name='green_taxi_trips', con=engine, if_exists='replace', chunksize=100000)
print("Green Taxi data uploaded! ✅")

# 3. Ingest Zones Data (CSV)
print("Reading Zones file...")
df_zones = pd.read_csv('taxi_zone_lookup.csv')

print(f"Uploading {len(df_zones)} zones to Postgres...")
df_zones.to_sql(name='zones', con=engine, if_exists='replace')
print("Zones data uploaded! ✅")

Reading Parquet file...
Uploading 46912 rows to Postgres...
Green Taxi data uploaded! ✅
Reading Zones file...
Uploading 265 zones to Postgres...
Zones data uploaded! ✅

In [4]:
# Check the row count
query = "SELECT count(*) FROM green_taxi_trips"
pd.read_sql(query, con=engine)

   count
0  46912

In [5]:
query = """
SELECT count(*) 
FROM green_taxi_trips 
WHERE lpep_pickup_datetime >= '2025-11-01' 
  AND lpep_pickup_datetime < '2025-12-01'
  AND trip_distance <= 1;
"""
pd.read_sql(query, con=engine)

   count
0   8007

Question 4. Longest trip for each day

Which was the pick up day with the longest trip distance? Only consider trips with trip_distance less than 100 miles (to exclude data errors).

Use the pick up time for your calculations.

2025-11-14
2025-11-20
2025-11-23
2025-11-25

In [6]:
query = "SELECT * FROM green_taxi_trips LIMIT 2"
pd.read_sql(query, con=engine)

,index,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,...,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge,cbd_congestion_fee
0,0,2,2025-11-01 00:34:48,2025-11-01 00:41:39,N,1.0,74,42,1.0,0.74,...,0.5,1.94,0.0,None,1.0,11.64,1.0,1.0,0.0,0.0
1,1,2,2025-11-01 00:18:52,2025-11-01 00:24:27,N,1.0,74,42,2.0,0.95,...,0.5,0.00,0.0,None,1.0,9.70,2.0,1.0,0.0,0.0

In [11]:
query = """
SELECT lpep_pickup_datetime, trip_distance 
FROM green_taxi_trips 
WHERE trip_distance < 100
ORDER BY trip_distance DESC
LIMIT 3;
"""
pd.read_sql(query, con=engine)

  lpep_pickup_datetime  trip_distance
0  2025-11-14 15:36:27          88.03
1  2025-11-20 12:28:02          73.84
2  2025-11-23 10:12:18          45.26

Question 5. Biggest pickup zone

Which was the pickup zone with the largest total_amount (sum of all trips) on November 18th, 2025?

East Harlem North
East Harlem South
Morningside Heights
Forest Hills

In [12]:
query = "SELECT * FROM green_taxi_trips LIMIT 2"
pd.read_sql(query, con=engine)

,index,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,...,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge,cbd_congestion_fee
0,0,2,2025-11-01 00:34:48,2025-11-01 00:41:39,N,1.0,74,42,1.0,0.74,...,0.5,1.94,0.0,None,1.0,11.64,1.0,1.0,0.0,0.0
1,1,2,2025-11-01 00:18:52,2025-11-01 00:24:27,N,1.0,74,42,2.0,0.95,...,0.5,0.00,0.0,None,1.0,9.70,2.0,1.0,0.0,0.0

In [13]:
query = "SELECT * FROM zones LIMIT 2"
pd.read_sql(query, con=engine)

   index  LocationID Borough            Zone service_zone
0      0           1     EWR  Newark Airport          EWR
1      1           2  Queens     Jamaica Bay    Boro Zone

In [28]:
query = """
SELECT "Zone",
       COUNT(*)
FROM green_taxi_trips gtt
INNER JOIN zones z
ON gtt."PULocationID" = z."LocationID"
WHERE CAST(gtt.lpep_pickup_datetime AS DATE) = '2025-11-18'
GROUP BY 1
ORDER BY 2 DESC
LIMIT 5;
"""
pd.read_sql(query, con=engine)

                  Zone  count
0    East Harlem North    434
1    East Harlem South    298
2         Central Park    104
3  Morningside Heights     88
4         Forest Hills     72

In [29]:
query = """
SELECT 
    z."Zone",
    SUM(gtt.total_amount)  -- Changed from COUNT(*) to SUM
FROM green_taxi_trips gtt
JOIN zones z
    ON gtt."PULocationID" = z."LocationID"
WHERE CAST(gtt.lpep_pickup_datetime AS DATE) = '2025-11-18' -- Added Date Filter
GROUP BY 1
ORDER BY 2 DESC
LIMIT 5;
"""
pd.read_sql(query, con=engine)

                       Zone      sum
0         East Harlem North  9281.92
1         East Harlem South  6696.13
2              Central Park  2378.79
3  Washington Heights South  2139.05
4       Morningside Heights  2100.59

Question 6. Largest tip

For the passengers picked up in the zone named "East Harlem North" in November 2025, which was the drop off zone that had the largest tip?

Note: it's tip , not trip. We need the name of the zone, not the ID.

JFK Airport
Yorkville West
East Harlem North
LaGuardia Airport

In [22]:
query = """
SELECT z."Zone", z2."Zone", gtt.tip_amount
FROM green_taxi_trips gtt
INNER JOIN zones z
ON gtt."PULocationID" = z."LocationID"
INNER JOIN zones z2
ON gtt."DOLocationID" = z2."LocationID"
WHERE z."Zone" = 'East Harlem North'
ORDER BY gtt.tip_amount DESC;
"""
pd.read_sql(query, con=engine)

                    Zone                           Zone  tip_amount
0      East Harlem North                 Yorkville West       81.89
1      East Harlem North              LaGuardia Airport       50.00
2      East Harlem North              East Harlem North       45.00
3      East Harlem North  Long Island City/Queens Plaza       34.25
4      East Harlem North                            NaN       28.90
...                  ...                            ...         ...
12044  East Harlem North       Washington Heights South        0.00
12045  East Harlem North                   Central Park        0.00
12046  East Harlem North          Soundview/Castle Hill        0.00
12047  East Harlem North                 Yorkville West        0.00
12048  East Harlem North          Upper West Side North        0.00

[12049 rows x 3 columns]